# 2*.написать функцию которая создает персонажа в игре
# в игре 3 класса *маг лучник воин
# 6 характеристик *сила выносливость ловкость харизма интеллект удача
# нужно задать какой у тебя *класс, *имя персонажа, *раса(эльф орк и тд)
# характеристики рандомятся,
# причем у воина 1и2 характеристика должны быть больше
# у лучника 3и4
# у мага 5и6
# сумма характеристик=30
# на выходе получается вот так:
#
# ваш персонаж: вальдемар воин орк
#
# сила         9
# выносливость 9
# ловкость     2
# харизма      3
# интеллект    2
# удача        5
