# 1.существует 3 списка со школьными предметами
# ['чтение','пение','рисование','математика'] 1-4класс
# [здесь 8 предметов]5-8класс
# [здесь 12 предметов]9-11класс

# написать функцию которая создает расписание на 5 дней
# нужно указать *номер класса
# для 1го списка 3 урока в день
# для 2го 4 урока в день
# для 3го 5 уроков в день
# уроки выбираются случайно
# .choice(spisok) <-случайный выбор из списка библиотеке random

les4 = ["subj1", "subj2", "subj3", "subj4"]

les8 = ["subj1", "subj2", "subj3", "subj4",
        "subj5", "subj6", "subj7", "subj8"]

les11 = ["subj1", "subj2", "subj3", "subj4", "subj5", "subj6",
         "subj7", "subj8", "subj9", "subj10", "subj11", "subj12"]
DAY_PER_WEEK = 5
les_p_day4 = 3
les_p_day8 = 4
les_p_day11 = 5

var = input("Для каких классов составить расписание?\n 1 - 1-4 класс\n 2 - 5-8 класс\n 3 - 9-11 класс\n")
    if var == "1":
        print('smthn')
    # elif var == "2":
    #     pass
    # elif var == "3":
    #     pass
    # else:
    #     print("Введите верное значение")

def func():
    pass

mon_les = []
tu_les = []
wed_les = []