"""
1. создать класс kino()
при создании фильма нужно задать
*название *режиссер *страна
создать три фильма

2.в классе создать методы
выходит в кинотеатре
выходит на онлайн
переводится на какой-то язык

метод выводит на экран текст
 *название фильма
и что с ним происходит
продемонстрировать как методы работают
"""

class Kino:
    """Класс для предоставления данных о фильмах"""
    name = ""
    director = ""
    country = ""

    def cinema(self, name):
        print()
        pass

    def online(self, name):
        print()
        pass

    def translate(self, name):
        print()
        pass


    