"""Задание 1
Пользователь с клавиатуры вводит двухзначное число. Например, 26.
Нужно показать на разных строках значение первого и второго разряда.
В нашем случае это будет выглядеть так:
2
6
"""



"""
Задание 2
Пользователь с клавиатуры вводит трёхзначное число. 
Например, 891. Нужно показать на разных строках значение первого,
второго и третьего разряда. 
Также нужно показать на отдельной строке сумму этих трёх чисел.
8
9
1
18
"""


"""
Задание 3
Пользователь вводит с клавиатуры две цифры. Необходимо создать число,
содержащее эти цифры. Например, если с клавиатуры введено 9, 7,
тогда нужно сформировать число 97.
"""


"""
Задание 4
Пользователь вводит с клавиатуры температуру по шкале Цельсия.
Требуется перевести температуру в градусы по Фаренгейту и вывести на экран.
"""